tap "homebrew/bundle"
tap "FelixKratz/formulae"

# Core tools
brew "git"
brew "wget"
brew "jq"
brew "gh"
brew "eza"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "ripgrep"
brew "node"
brew "python@3.13"
brew "tree-sitter"

# Neovim
brew "neovim"

# Superfile (terminal file manager)
brew "superfile"

# SketchyBar
brew "FelixKratz/formulae/sketchybar"

# AeroSpace window manager
cask "nikitabobko/tap/aerospace"

# Nerd Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
